Revit 2027 API
BuiltInFailures.AssemblyFailures.AssemblyNewTypeWarn Property
 Edits to these assemblies match existing type and will inherit that name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AssemblyNewTypeWarn { get; }
Public Shared ReadOnly Property AssemblyNewTypeWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AssemblyNewTypeWarn {
	FailureDefinitionId^ get ();
}
static member AssemblyNewTypeWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace